"""
Задача 1.
1.Напишіть програму, яка отримує на вхід чотиризначне додатне десяткове
число та генерує з цифр цього числа мінімально можливе чотиризначне число та
максимально можливе чотиризначне число. У першому рядку задано одне чотиризначне
число. Виведіть у другому рядку два числа - найменше чотиризначне число та
найбільше чотиризначне число, які можна отримати з цифр даного числа. Числа
розділяйте одним пропуском.

Автор: Волочнюк Поліна
"""

n = input("Введіть чотиризначне число: ")
numbers = []

for i in range(len(n)):
    numbers.append(n[i])
min_number = sorted(numbers)
max_number = sorted(numbers, reverse=True)
min_number = "".join(min_number)
max_number = ''.join(max_number)

print(min_number, max_number)
